W4D1/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email") VALUES ($1, $2) RETURNING "id"  [["username", "porfy"], ["email", "sflfjasf@msn.com"]]

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "email" = $2 WHERE "users"."id" = $3  [["username", "porfy"], ["email", "sflfjasf@msn.com"], ["id", 1]]